[
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
       "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "price": 99.99,
        "total_students": 214122,
        "course-duration": 15.8,
        "course-lecture": 225,
        "title": "Flutter & Dart - The Complete Guide [2022 Edition]",
        "author": {
            "name": "Maximilian Schwarzmüller",
            "Last updated": "5/2022",
            "img": "https://img-b.udemycdn.com/user/200_H/13952972_e853.jpg"
        },
        "thumbnail_url": "https://img-b.udemycdn.com/course/240x135/1708340_7108_5.jpg",
        "image_url": "https://img-b.udemycdn.com/course/240x135/1708340_7108_5.jpg",
        "details": "Join the most comprehensive & bestselling Flutter course and learn how to build amazing iOS and Android apps! You don't need to learn Android/ Java and iOS/ Swift to build real native mobile apps! <br/> Flutter - a framework developed by Google - allows you to learn one language (Dart) and build beautiful native mobile apps in no time. Flutter is a SDK providing the tooling to compile Dart code into native code and it also gives you a rich set of pre-built and pre-styled UI elements (so called widgets) which you can use to compose your user interfaces. Flutter is extremely trending and gets used for major Google apps like their Adwords app - it's now marked as 'ready for production', hence now is the time to jump in and learn it!<br> This course will teach Flutter & Dart from scratch, NO prior knowledge of either of the two is required! And you certainly don't need any Android or iOS development experience since the whole idea behind Flutter is to only learn one language. You'll learn Flutter not only in theory but we'll build a complete, realistic app throughout this course. This app will feature both all the core basics as well as advanced features like using Google Maps, the device camera, adding animations and more! With Flutter, you'll be able to write code only once and ship your apps both to the Apple AppStore and Google Play.Use Google's Material Design to build beautiful, yet fully customizable, apps in no time with almost zero effort. You can use the rich widget suite Flutter provides to add common UI elements like buttons, switches, forms, toolbars, lists and more - or you simply build your own widgets - Flutter makes that a breeze, too."
    },
    {
        "_id": "sdayqfce9kxn2phjbv3osdayqfce9kxn2phjbv3o",
        "category_id": "02",
        "rating": {
            "number": 4.6,
            "badge": "Excellent"
        },
        "price": 109.99,
        "total_students": 341482,
        "course-duration": 20.5,
        "course-lecture": 327,
        "title": "The Ultimate MySQL Bootcamp: Go from SQL Beginner to Expert",
        "author": {
            "name": "Colt Steele",
            "Last updated": "10/2022",
            "img": "https://img-b.udemycdn.com/user/200_H/4466306_6fd8_3.jpg"
        },
        "thumbnail_url": "https://img-b.udemycdn.com/course/240x135/1187016_51b3.jpg",
        "image_url": "https://img-b.udemycdn.com/course/240x135/1187016_51b3.jpg",
        "details": "If you want to learn how to gain insights from data but are too intimidated by databases to know where to start, then this course is for you. This course is a gentle but comprehensive introduction to MySQL, one of the most highly in-demand skills in the business sector today. Whether you work in sales or marketing, you run your own company, or you want to build your own apps, mastering MySQL is crucial to answering complex business problems and questions using insights from data. The Ultimate MySQL Bootcamp introduces you to a solid foundation in databases in a way that’s both informative and engaging. Yes, that’s right, it’s possible to make an engaging course on databases.<br> Consistently ranked the most in-demand skill in recent employer surveys, SQL is a fantastic way to increase your income and boost your professional development. So many companies today use MySQL, including Twitter, Uber, Airbnb, Dropbox, Github, Kickstarter, Udemy, Slack, and many others. Unsure about the difference between SQL and MySQL? MySQL is the most popular open source SQL database out there, so it’s a great choice to begin your learning journey. We’ll talk a lot more about the difference between SQL and MySQL in the course, but 95% of what you learn about MySQL in this course will apply to other databases such as Postgres, Oracle, and Microsoft SQL Server. My teaching experience is rooted in the classroom. I’ve spent years teaching programming, web development, and databases to my in-person bootcamp students. This course combines the best of my offline courses with the convenience of learning online, in a setting that’s best for you. Upon completing this course, you’ll be able to interact with and query any SQL database out there. You’ll also be able to generate reports with ease, answer company performance questions using data, and integrate MySQL into complete applications.So let’s do this! Enroll today and start learning SQL!"
    },
    {
        "_id": "i1bsp4q386vkezfmunxli1bsp4q386vkezfmunxl",
        "category_id": "03",
        "rating": {
            "number": 4.6,
            "badge": "Excellent"
        },
        "price": 119.99,
        "total_students": 585025,
        "course-duration": 25,
        "course-lecture": 165,
        "title": "Python for Data Science and Machine Learning Bootcamp",
        "author": {
            "name": "Jose Portilla",
            "Last updated": "2/2022",
            "img": "https://img-b.udemycdn.com/user/200_H/9685726_67e7_4.jpg"
        },
        "thumbnail_url": "https://img-b.udemycdn.com/course/240x135/903744_8eb2.jpg",
        "image_url": "https://img-b.udemycdn.com/course/240x135/903744_8eb2.jpg",
        "details": "Are you ready to start your path to becoming a Data Scientist!<br> This comprehensive course will be your guide to learning how to use the power of Python to analyze data, create beautiful visualizations, and use powerful machine learning algorithms!<br> Data Scientist has been ranked the number one job on Glassdoor and the average salary of a data scientist is over $120,000 in the United States according to Indeed! Data Science is a rewarding career that allows you to solve some of the world's most interesting problems!<br> This course is designed for both beginners with some programming experience or experienced developers looking to make the jump to Data Science!<br> This comprehensive course is comparable to other Data Science bootcamps that usually cost thousands of dollars, but now you can learn all that information at a fraction of the cost! With over 100 HD video lectures and detailed code notebooks for every lecture this is one of the most comprehensive course for data science and machine learning on Udemy!"
    },
    {
        "_id": "zxbie2h4yja6qugdw58czxbie2h4yja6qugdw58c",
        "category_id": "04",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "price": 84.99,
        "total_students": 38243,
        "course-duration": 39,
        "course-lecture": 313,
        "title": "The Modern React Bootcamp (Hooks, Context, NextJS, Router)",
        "author": {
            "name": "Colt Steele",
            "Last updated": "5/2019",
            "img": "https://img-b.udemycdn.com/user/200_H/4466306_6fd8_3.jpg"
        },
        "thumbnail_url": "https://img-b.udemycdn.com/course/240x135/2320056_4fa0_6.jpg",
        "image_url": "https://img-b.udemycdn.com/course/240x135/2320056_4fa0_6.jpg",
        "details": "EXPANDED and UPDATED to include new sections on Next JS and Server-Side Rendering!<br> Welcome to the best online resource for learning React! Published in April 2019, this course is brand new and covers the latest in React.  This course follows the exact same React curriculum my in-person bootcamp students follow in San Francisco, where students have gone on to get jobs at places like Google, Apple, Pinterest, & Linkedin.  This is the most polished React course online, and it's the only course that is based on REAL bootcamp curriculum that has been tried and tested in the classroom.<br> This course builds up concepts one at a time, cementing each new topic with an expertly designed exercise or project to test your knowledge. It includes a huge variety of beautiful exercises, projects, and games that we create together from scratch.  Sometimes we mix things up and give you a broken React app and ask you to fix it or optimize the code. Check out the promo video to see a couple of the course exercises. The course culminates in one huge capstone project, which is the largest project I've ever built for any of my online courses.  I'm really excited about it.<br> React is the most popular JS library around, and there's never been a better time to learn it! Companies all over the world are turning to React to help manage their JavaScript chaos, including tech giants like Facebook, Airbnb, and Uber.  React is consistently voted the most loved and most wanted front-end framework by developers, and it's clear why! React is a joy to use, and it makes writing maintainable and modular JavaScript code a breeze.<br> If you're new to frameworks, React is the ideal first framework to learn. It's easy enough to learn the basics, but it doesn't teach you bad habits. Even if you've already enrolled in another React course, this course is worth your time for the exercises and projects alone!  This curriculum is the product of two years of development and iteration in the bootcamp classroom.   All the lectures, exercises, and projects have been tweaked and improved based on real student feedback. You won't find anything else online as structured and polished as this course."
    },
    {
        "_id": "2ty3ei9wkacognqsdju82ty3ei9wkacognqsdju8",
        "category_id": "04",
        "rating": {
            "number": 4.4,
            "badge": "Excellent"
        },
        "price": 129.99,
        "total_students": 107191,
        "course-duration": 29.5,
        "course-lecture": 376,
        "title": "The Complete Angular Course: Beginner to Advanced",
        "author": {
            "name": "Mosh Hamedani",
            "Last updated": "8/2020",
            "img": "https://img-b.udemycdn.com/user/200_H/712832_5e8d_3.jpg"
        },
        "thumbnail_url": "https://img-b.udemycdn.com/course/240x135/1247828_32bb.jpg",
        "image_url": "https://img-b.udemycdn.com/course/240x135/1247828_32bb.jpg",
        "details": "Angular is one of the most popular frameworks for building client apps with HTML, CSS and TypeScript. If you want to establish yourself as a front-end or a full-stack developer, you need to learn Angular.<br> If you've been confused or frustrated jumping from one Angular 4 tutorial to another, you've come to the right place. In this course, Mosh, author of several best-selling courses on CodeAcademy, takes you on a fun and pragmatic journey to master Angular 4. <br> By the end of watching this course, you'll be able to: Build real client apps with Angular on your own, Troubleshoot common compile-time and run-time errors, Write clean and maintainable code like a professional, Apply best practices when building Angular apps, Right from the beginning, you'll jump in and build your first Angular app within minutes. Say goodbye to boring tutorials and courses with rambling instructors and useless theories!<br> Angular 2+ has been written in TypeScript. So, in section 2, you'll learn the fundamentals of TypeScript and object-oriented programming to better understand and appreciate this powerful framework. "
    },
    {
        "_id": "2ezxkyq07vhb4p1muoi92ezxkyq07vhb4p1muoi9",
        "category_id": "04",
        "rating": {
            "number": 4.7,
            "badge": "Excellent"
        },
        "price": 84.99,
        "total_students": 172899,
        "course-duration": 15,
        "course-lecture": 198,
        "title": "Understanding TypeScript",
        "author": {
            "name": "Maximilian Schwarzmüller",
            "Last updated": "8/2022",
            "img": "https://img-b.udemycdn.com/user/200_H/13952972_e853.jpg"
        },
        "thumbnail_url": "https://img-b.udemycdn.com/course/240x135/947098_02ec_2.jpg",
        "image_url": "https://img-b.udemycdn.com/course/240x135/947098_02ec_2.jpg",
        "details": "Join this bestselling, completely updated course to learn TypeScript from the ground up, in great depth!<br> Learn what TypeScript is, why it really is a powerful addition to JavaScript, what its features are and how to use it! Learn why TypeScript is amazing, how it improves your JavaScript code and how it helps you avoid nasty bugs and errors!<br> This course takes you from the very basics and its most important feature (types!) to the point where you're able to use TypeScript in any of your projects. ReactJS projects included!<br> As TypeScript is developed by Microsoft and strongly advertised and used by Angular 2+ (Google) and other popular libraries, it's here to stay. Indeed, TypeScript is one of the most popular web development languages you can learn these days!<br> Gain an edge today and be amongst the first to really understand TypeScript!<br> Learn how you can use TypeScript to bring modern JS features like destructuring, arrow functions or classes to any environment and codebase - even if it does not support those features yet!  Understand which types you may use and how you can build your own types. Learn how to write better code with types and with the many features offered by TypeScript!<br> But, in this course, we'll not stop after the basics! You will also learn about more advanced features (like decorators) and also how to set up workflows with  TypeScript. This includes a TypeScript-only workflow as well as a webpack workflow.<br> You'll also learn that you're not limited to Angular or plain JavaScript/ TypeScript projects. Instead, a complete module covers how you may use TypeScript with ReactJS and improve your React code with TypeScript as well.<br> Practice what you learn!"
    },
]